pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/banner-names-the-cheaper-job.patch
# gate: tests/test_controller_view.py -q -k outside_every_bind
diff --git a/pylauncher/yulon/ui/controller_view.py b/pylauncher/yulon/ui/controller_view.py
index 14de9d31..cdd004a4 100644
--- a/pylauncher/yulon/ui/controller_view.py
+++ b/pylauncher/yulon/ui/controller_view.py
@@ -7010,7 +7010,7 @@ class ControllerView(QWidget):
         restart = sorted(self._tuning_owed.get("restart", ()))
         self.tuning_recreate_button.setEnabled(bool(recreate) and not self._busy)
         self.tuning_restart_button.setEnabled(bool(restart or recreate) and not self._busy)
-        job = "recreate" if recreate else ("restart" if restart else None)
+        job = "restart" if restart else ("recreate" if recreate else None)
         if job is None:
             self.tuning_banner.setVisible(False)
             return
