pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/bounds-shown-for-one-bound-int.patch
# gate: tests/test_tuning_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/tuning_panel.py b/pylauncher/yulon/ui/widgets/tuning_panel.py
index fe8ef679..08d39221 100644
--- a/pylauncher/yulon/ui/widgets/tuning_panel.py
+++ b/pylauncher/yulon/ui/widgets/tuning_panel.py
@@ -348,7 +348,7 @@ def bounds_note(row: TuningRow) -> str | None:
     catalog never declared -- the invention that function refuses a spinner
     over in the first place.
     """
-    if row.type != "int" or row.min is None or row.max is None:
+    if row.type != "int" or (row.min is None and row.max is None):
         return None
     return f"{row.min}–{row.max}"
 
