pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/card-hint-keyed-off-the-family.patch
# gate: tests/test_tuning_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/tuning_panel.py b/pylauncher/yulon/ui/widgets/tuning_panel.py
index fe8ef679..c31fe06e 100644
--- a/pylauncher/yulon/ui/widgets/tuning_panel.py
+++ b/pylauncher/yulon/ui/widgets/tuning_panel.py
@@ -360,7 +360,7 @@ def card_hint(card: TuningCard) -> str:
     spans two is honest only about the half a user is most likely to be
     surprised by.
     """
-    backends = {row.backend for row in card.rows}
+    backends = {"conf"}
     if "lua" in backends:
         return HINT_LUA
     if "other" in backends:
