pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/changed-line-drops-the-key.patch
# gate: tests/test_tuning_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/tuning_panel.py b/pylauncher/yulon/ui/widgets/tuning_panel.py
index fe8ef679..f860e4a4 100644
--- a/pylauncher/yulon/ui/widgets/tuning_panel.py
+++ b/pylauncher/yulon/ui/widgets/tuning_panel.py
@@ -105,7 +105,7 @@ NOTHING = "nothing"
 An empty string in that sentence reads as a value the file held and lost.
 """
 
-CHANGED_FROM = "{key} · was {old}"
+CHANGED_FROM = "{key:.0}changed from {old}"
 """What a changed row says, and it NAMES THE KEY (T44 item 10).
 
 `changed from 10` on a card of twelve settings says which value, not which
