pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/chip-action-label-missing.patch
# gate: tests/test_modules_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/modules_panel.py b/pylauncher/yulon/ui/widgets/modules_panel.py
index 4bd0e2dc..4b43aa1b 100644
--- a/pylauncher/yulon/ui/widgets/modules_panel.py
+++ b/pylauncher/yulon/ui/widgets/modules_panel.py
@@ -164,7 +164,6 @@ and routing on the button's TEXT would break the day one of these is reworded.
 
 CHIP_ACTION_LABELS: dict[ChipAction, str] = {
     "rebuild": "Rebuild server…",
-    "sql": "Apply module SQL",
     "update": "Update",
 }
 """What each action's button says, spelled HERE rather than imported.
