pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/conf-keys-reads-comments.patch
# gate: tests/test_tuning.py -q
diff --git a/pylauncher/yulon/tuning.py b/pylauncher/yulon/tuning.py
index 67425a6d..5f6839b8 100644
--- a/pylauncher/yulon/tuning.py
+++ b/pylauncher/yulon/tuning.py
@@ -242,8 +242,6 @@ def conf_keys(text: str) -> tuple[str, ...]:
     found: list[str] = []
     for raw in text.split("\n"):
         line = raw.rstrip("\r").strip()
-        if _is_conf_comment(line):
-            continue
         cut = line.find("=")
         if cut <= 0:
             continue
