pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/env-name-ignores-case-boundaries.patch
# gate: tests/test_catalog_operations.py -q
diff --git a/pylauncher/yulon/catalog/composegen.py b/pylauncher/yulon/catalog/composegen.py
index 71e33b84..a9177790 100644
--- a/pylauncher/yulon/catalog/composegen.py
+++ b/pylauncher/yulon/catalog/composegen.py
@@ -148,11 +148,7 @@ def env_name_for(ini_key: str) -> str:
             out.append("_")
             previous = ""
             continue
-        boundary = previous and (
-            (previous.islower() and char.isupper())
-            or (previous.isalpha() and char.isdigit())
-            or (previous.isdigit() and char.isalpha())
-        )
+        boundary = False
         if boundary:
             out.append("_")
         out.append(char.upper())
