pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/every-chip-expands.patch
# gate: tests/test_modules_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/modules_panel.py b/pylauncher/yulon/ui/widgets/modules_panel.py
index 4bd0e2dc..716fb40f 100644
--- a/pylauncher/yulon/ui/widgets/modules_panel.py
+++ b/pylauncher/yulon/ui/widgets/modules_panel.py
@@ -718,7 +718,8 @@ class RowWidget(QFrame):
                 # click and would otherwise leave the row unselected while
                 # writing that row's sentence into the report -- the same reason
                 # `_row_install` selects before acting (round 2).
-                button.clicked.connect(lambda _checked=False, which=chip: self._chip(which))
+                pass
+            button.clicked.connect(lambda _checked=False, which=chip: self._chip(which))
             buttons.append(button)
             chips.addWidget(button)
         chips.addStretch(1)
