pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/every-text-box-is-free-text.patch
# gate: tests/test_tuning_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/tuning_panel.py b/pylauncher/yulon/ui/widgets/tuning_panel.py
index fe8ef679..f3c81b48 100644
--- a/pylauncher/yulon/ui/widgets/tuning_panel.py
+++ b/pylauncher/yulon/ui/widgets/tuning_panel.py
@@ -335,7 +335,7 @@ def row_chips(row: TuningRow, *, changed: bool = False) -> tuple[str, ...]:
         pending = PENDING_CHIPS.get(tuning.apply_rule(row))
         if pending is not None:
             chips.append(pending)
-    if control_kind(row) == "box" and row.type is None:
+    if control_kind(row) == "box":
         chips.append(CHIP_FREE_TEXT)
     return tuple(chips)
 
