pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/fact-chip-gets-an-action.patch
# gate: tests/test_modules_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/modules_panel.py b/pylauncher/yulon/ui/widgets/modules_panel.py
index 4bd0e2dc..01430194 100644
--- a/pylauncher/yulon/ui/widgets/modules_panel.py
+++ b/pylauncher/yulon/ui/widgets/modules_panel.py
@@ -436,6 +436,7 @@ def _chips_for(
                 Chip(
                     "fact",
                     CHIP_ASKS_A_QUESTION,
+                    action="rebuild",
                     "Installing this opens one dialog first: "
                     + ", ".join(prompt.question for prompt in asked),
                 )
