pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/failed-install-keeps-the-version.patch
# gate: tests/test_controller_view.py -q -k failed_install_forgets
diff --git a/pylauncher/yulon/ui/controller_view.py b/pylauncher/yulon/ui/controller_view.py
index 14de9d31..dd6313be 100644
--- a/pylauncher/yulon/ui/controller_view.py
+++ b/pylauncher/yulon/ui/controller_view.py
@@ -6393,7 +6393,7 @@ class ControllerView(QWidget):
             # version through `_note_session_facts()`, and leaving it here left
             # the row showing a sha the clone had moved off -- a wrong sha,
             # which item 1 says is worse than none.
-            self._versions.forget(acted_on.id)
+            pass
         self.module_report.setPlainText(f"{what} FAILED: {exc}")
         self.action_failed.emit(str(exc))
 
