pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/head-version-lets-oserror-out.patch
# gate: tests/test_git.py -q
diff --git a/pylauncher/yulon/git.py b/pylauncher/yulon/git.py
index 773d7a56..71d4b35e 100644
--- a/pylauncher/yulon/git.py
+++ b/pylauncher/yulon/git.py
@@ -709,7 +709,7 @@ class RunnerGit:
             return None
         try:
             proc = _run_git(["git", "log", "-1", f"--format={VERSION_FORMAT}"], cwd=dest)
-        except (GitError, OSError) as exc:
+        except GitError as exc:
             logger.debug(f"could not read what {dest} is at: {exc}")
             return None
         parts = proc.stdout.strip().split()
