pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/hint-is-built-but-never-laid-out.patch
# gate: tests/test_modules_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/modules_panel.py b/pylauncher/yulon/ui/widgets/modules_panel.py
index 4bd0e2dc..014609ab 100644
--- a/pylauncher/yulon/ui/widgets/modules_panel.py
+++ b/pylauncher/yulon/ui/widgets/modules_panel.py
@@ -905,7 +905,6 @@ class _FamilyCard(QGroupBox):
         self.hint_label = QLabel(hint, self)
         self.hint_label.setWordWrap(True)
         self.hint_label.setStyleSheet(f"color: {COLOR_TEXT_MUTED}; font-style: italic;")
-        box.addWidget(self.hint_label)
         self.installed_header = QLabel("Installed (0)", self)
         self.installed_header.setStyleSheet(f"color: {COLOR_TEXT_PRIMARY}; font-weight: bold;")
         box.addWidget(self.installed_header)
