pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/no-verdict-on-a-clean-file.patch
# gate: tests/test_tuning_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/tuning_panel.py b/pylauncher/yulon/ui/widgets/tuning_panel.py
index fe8ef679..9de1ac0b 100644
--- a/pylauncher/yulon/ui/widgets/tuning_panel.py
+++ b/pylauncher/yulon/ui/widgets/tuning_panel.py
@@ -962,7 +962,7 @@ class TuningPanel(QWidget):
         # a clean file and an unlinted one looked identical -- and a guard a
         # user cannot tell from a guard that is not running is not reassuring
         # anybody.
-        self.lint_label.setText(said or LINT_OK)
+        self.lint_label.setText(said or "")
         self.lint_label.setStyleSheet(
             f"color: {COLOR_TEXT_WARNING};" if said else f"color: {COLOR_UNCOMMON};"
         )
