pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/panel-qss-invents-a-colour.patch
# gate: tests/test_panel_style.py -q
diff --git a/pylauncher/yulon/ui/widgets/panel_style.py b/pylauncher/yulon/ui/widgets/panel_style.py
index 8a66b3fe..ac1a4ea5 100644
--- a/pylauncher/yulon/ui/widgets/panel_style.py
+++ b/pylauncher/yulon/ui/widgets/panel_style.py
@@ -56,7 +56,7 @@ QPushButton {{
     border-top: 1px solid {COLOR_GOLD_BRASS};
     border-left: 1px solid {COLOR_GOLD_BRASS};
     border-right: 1px solid {COLOR_BRASS_DEEP};
-    border-bottom: 2px solid {COLOR_BRASS_DEEP};
+    border-bottom: 2px solid #101010;
 }}
 QPushButton:pressed {{
     border-top: 2px solid {COLOR_BRASS_DEEP};
