pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/picker-gets-no-read-only-list.patch
# gate: tests/test_controller_view.py -q -k 'picker_marks or servers_own_conf'
diff --git a/pylauncher/yulon/ui/controller_view.py b/pylauncher/yulon/ui/controller_view.py
index 14de9d31..5d004507 100644
--- a/pylauncher/yulon/ui/controller_view.py
+++ b/pylauncher/yulon/ui/controller_view.py
@@ -6944,7 +6944,7 @@ class ControllerView(QWidget):
         # `TUNING_CORE_FILES` is a decision about who owns core configuration,
         # and a second copy of it inside a widget is a second place for it to
         # drift (T44 item 13).
-        self.tuning_panel.set_files(self._tuning_files(), read_only=TUNING_CORE_FILES)
+        self.tuning_panel.set_files(self._tuning_files())
         self._set_tuning_revert_all()
 
     @Slot()
