pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/picker-uses-colliding-basenames.patch
# gate: tests/test_tuning_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/tuning_panel.py b/pylauncher/yulon/ui/widgets/tuning_panel.py
index fe8ef679..3c92885d 100644
--- a/pylauncher/yulon/ui/widgets/tuning_panel.py
+++ b/pylauncher/yulon/ui/widgets/tuning_panel.py
@@ -313,7 +313,7 @@ def picker_label(file: str, *, duplicate: bool, read_only: bool) -> str:
     not: nothing makes a basename unique, and two modules that both ship
     `mod.conf` must not give a person two identical buttons.
     """
-    name = file if duplicate else file.rsplit("/", 1)[-1]
+    name = file.rsplit("/", 1)[-1]
     return f"{name}{READ_ONLY_SUFFIX}" if read_only else name
 
 
