pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/pressed-bevel-grows-the-box.patch
# gate: tests/test_panel_style.py -q
diff --git a/pylauncher/yulon/ui/widgets/panel_style.py b/pylauncher/yulon/ui/widgets/panel_style.py
index 8a66b3fe..3c8717bb 100644
--- a/pylauncher/yulon/ui/widgets/panel_style.py
+++ b/pylauncher/yulon/ui/widgets/panel_style.py
@@ -59,7 +59,7 @@ QPushButton {{
     border-bottom: 2px solid {COLOR_BRASS_DEEP};
 }}
 QPushButton:pressed {{
-    border-top: 2px solid {COLOR_BRASS_DEEP};
+    border-top: 3px solid {COLOR_BRASS_DEEP};
     border-left: 1px solid {COLOR_BRASS_DEEP};
     border-right: 1px solid {COLOR_GOLD_BRASS};
     border-bottom: 1px solid {COLOR_GOLD_BRASS};
