pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/raw-revert-armed-with-no-backup.patch
# gate: tests/test_tuning_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/tuning_panel.py b/pylauncher/yulon/ui/widgets/tuning_panel.py
index fe8ef679..e5fb4f63 100644
--- a/pylauncher/yulon/ui/widgets/tuning_panel.py
+++ b/pylauncher/yulon/ui/widgets/tuning_panel.py
@@ -899,9 +899,7 @@ class TuningPanel(QWidget):
     def set_backup(self, name: str | None) -> None:
         """Name the backup the last save took, and arm Revert (T44 item 15)."""
         self.backup_label.setText(f"Backup of this file as it was: {name}" if name else "")
-        self.file_revert_button.setEnabled(
-            self._actions_enabled and bool(name) and not self.editor.isReadOnly()
-        )
+        self.file_revert_button.setEnabled(True)
 
     def _mark_current(self, file: str) -> None:
         self._current_file = file
