pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/read-only-files-linted-too.patch
# gate: tests/test_tuning_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/tuning_panel.py b/pylauncher/yulon/ui/widgets/tuning_panel.py
index fe8ef679..64076041 100644
--- a/pylauncher/yulon/ui/widgets/tuning_panel.py
+++ b/pylauncher/yulon/ui/widgets/tuning_panel.py
@@ -954,9 +954,6 @@ class TuningPanel(QWidget):
         already read-only (`tuning._read_only_reason`) — so the read-only flag
         is the same gate, asked once.
         """
-        if self.editor.isReadOnly():
-            self.lint_label.setText("")
-            return
         said = tuning.lint_sentence(tuning.lint(self.editor.toPlainText()))
         # The verdict BOTH ways (T44 item 14). T43 drew only the complaint, so
         # a clean file and an unlinted one looked identical -- and a guard a
