pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/report-keeps-the-version-cache.patch
# gate: tests/test_controller_view.py -q -k refresh_forgets
diff --git a/pylauncher/yulon/ui/controller_view.py b/pylauncher/yulon/ui/controller_view.py
index 14de9d31..9b4da433 100644
--- a/pylauncher/yulon/ui/controller_view.py
+++ b/pylauncher/yulon/ui/controller_view.py
@@ -6345,7 +6345,6 @@ class ControllerView(QWidget):
         # commit now: an install clones or fast-forwards it, a remove deletes
         # it. Dropped before `reload_modules()` runs, so the redraw does not
         # hand the row the sha it had before the action (T44 item 1).
-        self._versions.forget(item_id)
         if acted_on is None or acted_on.id != item_id:
             # Unreachable through both live routes -- `_module_action()` and
             # `_install_custom_module()` each set `_acting_on` immediately
