pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/settings-counts-files.patch
# gate: tests/test_tuning_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/tuning_panel.py b/pylauncher/yulon/ui/widgets/tuning_panel.py
index fe8ef679..1cabd039 100644
--- a/pylauncher/yulon/ui/widgets/tuning_panel.py
+++ b/pylauncher/yulon/ui/widgets/tuning_panel.py
@@ -601,7 +601,7 @@ class CardWidget(QGroupBox):
         box.setSpacing(4)
 
         heading = QHBoxLayout()
-        self.count_label = QLabel(f"Settings {len(card.rows)}", self)
+        self.count_label = QLabel(f"Settings {len(card.files)}", self)
         self.count_label.setStyleSheet(f"color: {COLOR_TEXT_PRIMARY}; font-weight: bold;")
         heading.addWidget(self.count_label)
         # What KIND of thing these settings are, derived from the rows' own
