pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/shadow-match-is-case-blind.patch
# gate: tests/test_catalog_operations.py -q
diff --git a/pylauncher/yulon/catalog/composegen.py b/pylauncher/yulon/catalog/composegen.py
index 71e33b84..e6a5af1e 100644
--- a/pylauncher/yulon/catalog/composegen.py
+++ b/pylauncher/yulon/catalog/composegen.py
@@ -202,7 +202,7 @@ def shadowed_by_env(text: str, env: Mapping[str, str]) -> tuple[tuple[str, str],
     Tuning tab's, and this function is what tells it which files it applies to.
     """
     return tuple(
-        (key, name) for key in tuning.conf_keys(text) if (name := env_name_for(key)) in env
+        (key, name) for key in tuning.conf_keys(text) if (name := key) in env
     )
 
 
