pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/shadow-warning-on-every-editable-file.patch
# gate: tests/test_tuning_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/tuning_panel.py b/pylauncher/yulon/ui/widgets/tuning_panel.py
index fe8ef679..a8d0b49e 100644
--- a/pylauncher/yulon/ui/widgets/tuning_panel.py
+++ b/pylauncher/yulon/ui/widgets/tuning_panel.py
@@ -933,7 +933,7 @@ class TuningPanel(QWidget):
         # write: nothing can be typed into a read-only one, so no edit of it
         # can silently fail to apply (item 16, round 2).
         self.shadow_warning.setText(shadow_warning(shadowed) if shadowed else "")
-        self.shadow_warning.setVisible(bool(shadowed) and not read_only)
+        self.shadow_warning.setVisible(not read_only)
         self.file_save_button.setEnabled(self._actions_enabled and not read_only)
         # A backup of the file you were looking at a moment ago is not a
         # backup of this one, so the name goes with the text it described.
