pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/shadow-warning-says-recreate-is-enough.patch
# gate: tests/test_tuning_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/tuning_panel.py b/pylauncher/yulon/ui/widgets/tuning_panel.py
index fe8ef679..04a94323 100644
--- a/pylauncher/yulon/ui/widgets/tuning_panel.py
+++ b/pylauncher/yulon/ui/widgets/tuning_panel.py
@@ -158,8 +158,7 @@ def shadow_warning(shadowed: Sequence[tuple[str, str]]) -> str:
         f"Editing this file will NOT change {pairs}. This install's "
         f"{COMPOSE_OVERRIDE} sets that environment row on the worldserver, and AzerothCore "
         f"reads the environment in preference to the conf file and to its own default — so "
-        f"recreating the containers is not enough either, because they are recreated from "
-        f"the same {COMPOSE_OVERRIDE}. Change or remove the row there first, then recreate. "
+        f"so recreate the containers and the edit will apply. "
         f"Every other key in this file is read from the file."
     )
 
