pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/subpanel-button-emits-its-text.patch
# gate: tests/test_modules_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/modules_panel.py b/pylauncher/yulon/ui/widgets/modules_panel.py
index 4bd0e2dc..35f40b43 100644
--- a/pylauncher/yulon/ui/widgets/modules_panel.py
+++ b/pylauncher/yulon/ui/widgets/modules_panel.py
@@ -863,7 +863,7 @@ class RowWidget(QFrame):
     def _detail_action(self) -> None:
         chip = self._open_chip
         if chip is not None and chip.action is not None:
-            self.pressed_chip_action.emit(self.data.id, chip.action)
+            self.pressed_chip_action.emit(self.data.id, CHIP_ACTION_LABELS[chip.action])
 
     def detail_visible(self) -> bool:
         """Whether this row's subpanel is open, read off the widget and the LAYOUT.
