pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/subpanel-never-opens.patch
# gate: tests/test_modules_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/modules_panel.py b/pylauncher/yulon/ui/widgets/modules_panel.py
index 4bd0e2dc..4f8bf8db 100644
--- a/pylauncher/yulon/ui/widgets/modules_panel.py
+++ b/pylauncher/yulon/ui/widgets/modules_panel.py
@@ -858,7 +858,7 @@ class RowWidget(QFrame):
             )
             self.detail_button.setVisible(has_action)
             self.detail_button.setEnabled(self._actions_enabled and has_action)
-        self.detail.setVisible(True)
+        self.detail.setVisible(False)
 
     def _detail_action(self) -> None:
         chip = self._open_chip
