pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/subpanel-never-shuts.patch
# gate: tests/test_modules_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/modules_panel.py b/pylauncher/yulon/ui/widgets/modules_panel.py
index 4bd0e2dc..7f85d95c 100644
--- a/pylauncher/yulon/ui/widgets/modules_panel.py
+++ b/pylauncher/yulon/ui/widgets/modules_panel.py
@@ -845,10 +845,6 @@ class RowWidget(QFrame):
         """
         self.clicked.emit(self.data.id)
         self.pressed_chip.emit(self.data.id, chip.label)
-        if self._open_chip is chip:
-            self._open_chip = None
-            self.detail.setVisible(False)
-            return
         self._open_chip = chip
         self.detail_label.setText(chip.detail)
         if self.detail_button is not None:
