pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/subpanel-replaces-the-report-line.patch
# gate: tests/test_modules_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/modules_panel.py b/pylauncher/yulon/ui/widgets/modules_panel.py
index 4bd0e2dc..818b1a70 100644
--- a/pylauncher/yulon/ui/widgets/modules_panel.py
+++ b/pylauncher/yulon/ui/widgets/modules_panel.py
@@ -844,7 +844,6 @@ class RowWidget(QFrame):
         ever grow is a row that eats the card it is on.
         """
         self.clicked.emit(self.data.id)
-        self.pressed_chip.emit(self.data.id, chip.label)
         if self._open_chip is chip:
             self._open_chip = None
             self.detail.setVisible(False)
