pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/tuning-panel-wears-no-sheet.patch
# gate: tests/test_panel_style.py -q
diff --git a/pylauncher/yulon/ui/widgets/tuning_panel.py b/pylauncher/yulon/ui/widgets/tuning_panel.py
index fe8ef679..50e6f145 100644
--- a/pylauncher/yulon/ui/widgets/tuning_panel.py
+++ b/pylauncher/yulon/ui/widgets/tuning_panel.py
@@ -699,7 +699,6 @@ class TuningPanel(QWidget):
         self._cards: dict[tuple[str, str], CardWidget] = {}
         self._order: list[tuple[str, str]] = []
         self._actions_enabled = True
-        self.setStyleSheet(panel_qss())
         outer = QVBoxLayout(self)
         outer.setContentsMargins(0, 0, 0, 0)
         self.split = QSplitter(Qt.Orientation.Horizontal, self)
