pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/tuning-view-passes-no-shadowed.patch
# gate: tests/test_controller_view.py -q -k compose_really_beats
diff --git a/pylauncher/yulon/ui/controller_view.py b/pylauncher/yulon/ui/controller_view.py
index 14de9d31..0133842e 100644
--- a/pylauncher/yulon/ui/controller_view.py
+++ b/pylauncher/yulon/ui/controller_view.py
@@ -7289,7 +7289,6 @@ class ControllerView(QWidget):
             # item 16, round 2). Asked of `composegen`, which is the module
             # that writes those rows, so the tab warns about the environment
             # this install really has rather than about every editable conf.
-            shadowed=composegen.shadowed_by_env(raw, composegen.world_env(self.entry)),
         )
 
     @Slot()
