pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/update-always-refuses.patch
# gate: tests/test_apply.py -q
diff --git a/pylauncher/yulon/apply.py b/pylauncher/yulon/apply.py
index 0f6ed549..f03d8196 100644
--- a/pylauncher/yulon/apply.py
+++ b/pylauncher/yulon/apply.py
@@ -1305,7 +1305,7 @@ class Applier:
         installed: the press the user made was Update, and an Update that
         silently installs is a different action wearing the same button.
         """
-        refusal = self._update_refusal(manifest)
+        refusal = self._update_refusal(manifest) or "no"
         if refusal is not None:
             raise ApplyError(refusal)
         return self.install(manifest, values)
