pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/update-chip-has-no-action.patch
# gate: tests/test_modules_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/modules_panel.py b/pylauncher/yulon/ui/widgets/modules_panel.py
index 4bd0e2dc..bad30a40 100644
--- a/pylauncher/yulon/ui/widgets/modules_panel.py
+++ b/pylauncher/yulon/ui/widgets/modules_panel.py
@@ -422,7 +422,6 @@ def _chips_for(
                 "module's install questions again. It REFUSES rather than reset if the "
                 "folder is a different repository, has uncommitted changes in it, or "
                 "carries commits the upstream does not, and says which.",
-                "update",
             )
         )
     if manifest is not None and not installed:
