pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/update-fetches-before-it-looks.patch
# gate: tests/test_apply.py -q
diff --git a/pylauncher/yulon/apply.py b/pylauncher/yulon/apply.py
index 0f6ed549..1cb96de4 100644
--- a/pylauncher/yulon/apply.py
+++ b/pylauncher/yulon/apply.py
@@ -1331,6 +1331,7 @@ class Applier:
                 f"nothing to update. Install it first. Nothing was changed."
             )
         url = manifest.source.url
+        self.no_local_commits(clone, manifest.source.branch)
         remote = self.remote_url(clone)
         if remote is None:
             return (
