pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/update-installs-a-missing-clone.patch
# gate: tests/test_apply.py -q
diff --git a/pylauncher/yulon/apply.py b/pylauncher/yulon/apply.py
index 0f6ed549..e84759c0 100644
--- a/pylauncher/yulon/apply.py
+++ b/pylauncher/yulon/apply.py
@@ -1325,7 +1325,7 @@ class Applier:
                 f"{manifest.id} is not cloned from anywhere, so there is nothing to update. "
                 f"Nothing was changed."
             )
-        if not (clone / ".git").is_dir():
+        if False:
             return (
                 f"{manifest.id} is not installed here as a git checkout ({rel}), so there is "
                 f"nothing to update. Install it first. Nothing was changed."
