pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/update-press-routes-to-remove.patch
# gate: tests/test_controller_view.py -q -k update_press
diff --git a/pylauncher/yulon/ui/controller_view.py b/pylauncher/yulon/ui/controller_view.py
index 14de9d31..8ec660f4 100644
--- a/pylauncher/yulon/ui/controller_view.py
+++ b/pylauncher/yulon/ui/controller_view.py
@@ -6124,7 +6124,7 @@ class ControllerView(QWidget):
             # for a folder its own claim vouches for: the repository, the
             # working tree, and what HEAD carries. A `reset --hard` over work
             # nobody looked at is what the ticket forbids in so many words.
-            self._module_action("update")
+            self._module_action("remove")
 
     def _selected_row_is_uncatalogued(self) -> bool:
         """Is the selected row one of T41's "installed here, not in the catalog" rows?"""
