pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/update-skips-the-origin-check.patch
# gate: tests/test_apply.py -q -k different_repository tests/test_controller_view.py::test_the_update_press_refuses_a_checkout_of_another_repository
diff --git a/pylauncher/yulon/apply.py b/pylauncher/yulon/apply.py
index 0f6ed549..cfa1960b 100644
--- a/pylauncher/yulon/apply.py
+++ b/pylauncher/yulon/apply.py
@@ -1337,7 +1337,7 @@ class Applier:
                 f"{rel} is a git checkout, but git would not say what it is a checkout of, so "
                 f"{manifest.id} was not updated and nothing was changed."
             )
-        if not same_repo(remote, url):
+        if False:
             return (
                 f"{rel} is a checkout of {remote}, not of {url}. Updating {manifest.id} would "
                 f"reset that folder to {url} and then deploy this module over it. Nothing was "
