pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/update-skips-the-tree-check.patch
# gate: tests/test_apply.py -q
diff --git a/pylauncher/yulon/apply.py b/pylauncher/yulon/apply.py
index 0f6ed549..ac956827 100644
--- a/pylauncher/yulon/apply.py
+++ b/pylauncher/yulon/apply.py
@@ -1343,7 +1343,7 @@ class Applier:
                 f"reset that folder to {url} and then deploy this module over it. Nothing was "
                 f"changed."
             )
-        clean = self.unmodified(clone, ".")
+        clean = True
         if clean is not True:
             if clean is False:
                 return (
