pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/update-treats-unknown-as-clean.patch
# gate: tests/test_apply.py -q -k update
diff --git a/pylauncher/yulon/apply.py b/pylauncher/yulon/apply.py
index 0f6ed549..23c517c0 100644
--- a/pylauncher/yulon/apply.py
+++ b/pylauncher/yulon/apply.py
@@ -1344,7 +1344,7 @@ class Applier:
                 f"changed."
             )
         clean = self.unmodified(clone, ".")
-        if clean is not True:
+        if clean is False:
             if clean is False:
                 return (
                     f"{rel} has changes in it that are not committed. Updating {manifest.id} "
