pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/version-cache-known-reads.patch
# gate: tests/test_modules_panel.py -q -k 'known_never or remembered'
diff --git a/pylauncher/yulon/ui/widgets/modules_panel.py b/pylauncher/yulon/ui/widgets/modules_panel.py
index 4bd0e2dc..52b1aafa 100644
--- a/pylauncher/yulon/ui/widgets/modules_panel.py
+++ b/pylauncher/yulon/ui/widgets/modules_panel.py
@@ -343,7 +343,7 @@ class VersionCache:
         paint cannot block: a row whose clone has not been read yet carries
         `None` and simply shows nothing where the version goes.
         """
-        return self._known.get((server_dir, family, item_id))
+        return self.fill(server_dir, family, item_id)
 
     def fill(self, server_dir: Path, family: str, item_id: str) -> str | None:
         """The answer, reading the clone once if it has not been read yet."""
