pyplan/gates/t44-modules-gap-2026-09-13/mutations/patches/version-shown-for-uninstalled-rows.patch
# gate: tests/test_modules_panel.py -q
diff --git a/pylauncher/yulon/ui/widgets/modules_panel.py b/pylauncher/yulon/ui/widgets/modules_panel.py
index 4bd0e2dc..06201730 100644
--- a/pylauncher/yulon/ui/widgets/modules_panel.py
+++ b/pylauncher/yulon/ui/widgets/modules_panel.py
@@ -540,7 +540,7 @@ def build_module_rows(
             # Installed rows only. A catalog row that is not on disk has no
             # clone to read, and looking one up for all 41 would be 20 reads
             # of folders that are not there.
-            version=seen_versions.get((manifest.type, manifest.id)) if here else None,
+            version=seen_versions.get((manifest.type, manifest.id)),
         )
 
     # T41's per-FOLDER accounting, moved here from `reload_modules()`. `ale` and
