pyplan/gates/t49-windows-remove-2026-09-13/mutations/M2-remove-reverts-to-rmtree.patch
--- /tmp/mut.orig	2026-09-13 09:05:54.435003846 +0200
+++ pylauncher/yulon/apply.py	2026-09-13 09:05:54.451365911 +0200
@@ -1306,7 +1306,7 @@
             # a bare rmtree stops at the first one, having already deleted an
             # unknown part of the checkout. Reported from a real install:
             # `remove sod FAILED: [WinError 5] Access is denied: ...\\pack-2623....idx`.
-            rmtree.remove_tree(clone)
+            shutil.rmtree(clone)  # M2: the T49 defect put back
             log.done.append(f"rm -r {_rel(self.server_dir, clone)}")
         return self._report("remove", manifest, log)
 
