pyplan/gates/t52-challenge-modes-2026-09-13/mutations/M2-index-gains-a-ghost.patch
--- /tmp/idx.orig	2026-09-13 22:05:00.384620442 +0200
+++ pylauncher/manifests/wow-wotlk/modules.json	2026-09-13 22:05:00.401043721 +0200
@@ -21,6 +21,7 @@
     "mod-transmog",
     "mod-profession-progression",
     "mod-mount-scaling",
-    "mod-custom-login"
+    "mod-custom-login",
+    "mod-does-not-exist"
   ]
 }
