pyplan/gates/t58-module-install-without-git-2026-09-14/mutations/M1-always-host-git.patch
--- /tmp/ap.orig	2026-09-14 00:18:39.991020608 +0200
+++ pylauncher/yulon/apply.py	2026-09-14 00:18:40.006708809 +0200
@@ -86,7 +86,7 @@
     pull and no bind mount, and `ContainerGit` already falls back to it for the
     same reason.
     """
-    return RunnerGit() if git_available() else ContainerGit()
+    return RunnerGit()  # M1: the shipped bug
 
 
 def installed_clones(server_dir: Path) -> dict[str, frozenset[str]]:
