pyplan/gates/t58-module-install-without-git-2026-09-14/mutations/M2-spawn-failure-escapes-raw.patch
--- /tmp/ap.orig	2026-09-14 00:18:42.784199057 +0200
+++ pylauncher/yulon/apply.py	2026-09-14 00:18:42.798268217 +0200
@@ -1251,8 +1251,7 @@
                 # reached two users as a bare `[WinError 2]` naming neither git
                 # nor a remedy (T58). GitError is caught below; this is the
                 # narrower case of git not being startable at all.
-                if isinstance(exc, GitError):
-                    raise
+                raise  # M2: OSError escapes as [WinError 2] again
                 raise ApplyError(
                     f"{manifest.id} could not be installed because git could not be started "
                     f"({exc}). Yu'lon clones modules with git, and falls back to running it "
